# =============================================================================
# Brewfile - Cross-platform packages
# Install: brew bundle --file=Brewfile
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "homebrew/bundle"

# -----------------------------------------------------------------------------
# Core CLI Tools
# -----------------------------------------------------------------------------
brew "bat"           # Better cat
brew "btop"          # System monitor
brew "chezmoi"       # Dotfiles manager
brew "delta"         # Better git diff
brew "direnv"        # Per-directory environment
brew "eza"           # Better ls
brew "fd"            # Better find
brew "fnm"           # Fast Node Manager
brew "fzf"           # Fuzzy finder
brew "gh"            # GitHub CLI
brew "git"           # Version control
brew "jq"            # JSON processor
brew "ripgrep"       # Better grep
brew "starship"      # Cross-shell prompt
brew "tree"          # Directory tree
brew "zoxide"        # Smart cd
brew "zsh"           # Shell

# -----------------------------------------------------------------------------
# Development Tools
# -----------------------------------------------------------------------------
brew "broot"         # File manager
brew "curl"          # HTTP client
brew "httpie"        # User-friendly HTTP client
brew "nano"          # Text editor
brew "tldr"          # Simplified man pages
brew "wget"          # File downloader

# -----------------------------------------------------------------------------
# Python
# -----------------------------------------------------------------------------
brew "python@3.12"   # Python
brew "uv"            # Fast Python package manager

# -----------------------------------------------------------------------------
# Zsh Plugins (installed via Homebrew on macOS)
# -----------------------------------------------------------------------------
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# -----------------------------------------------------------------------------
# Encryption & Security
# -----------------------------------------------------------------------------
brew "age"           # Modern encryption
brew "gnupg"         # GPG

# -----------------------------------------------------------------------------
# System Info
# -----------------------------------------------------------------------------
brew "fastfetch"     # System info display
brew "htop"          # Process viewer

# -----------------------------------------------------------------------------
# Optional Tools (uncomment if needed)
# -----------------------------------------------------------------------------
# brew "docker"      # Containerization
# brew "go"          # Go language
# brew "rust"        # Rust language
# brew "neovim"      # Vim fork
# brew "tmux"        # Terminal multiplexer
# brew "lazygit"     # Git TUI
