# VS Code Extensions
# Install all: cat extensions.txt | xargs -L 1 code --install-extension

# Theme & Icons
zhuangtongfa.material-theme
pkief.material-icon-theme

# Editor Enhancement
esbenp.prettier-vscode
usernamehw.errorlens
streetsidesoftware.code-spell-checker
wayou.vscode-todo-highlight
aaron-bond.better-comments
naumovs.color-highlight

# Git
eamodio.gitlens
mhutchie.git-graph

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
ms-python.isort

# JavaScript/TypeScript
dbaeumer.vscode-eslint
bradlc.vscode-tailwindcss

# Docker
ms-azuretools.vscode-docker

# Remote Development
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl

# Utilities
formulahendry.auto-rename-tag
christian-kohler.path-intellisense
mikestead.dotenv

# API Development
humao.rest-client
